1 rem copy right micro parts, 1982
2 print chr$(14): rem dist 10
3 clr
4 ti$ = "000000"
5 fu = 0
6 j = 0
7 gosub 419
8 x = rnd( - ti)
9 r = 0
10 a = 1
11 can = 1
12 mat = 1
13 gosub 385
14 rem poke 36869, 192: poke 36879, 25: print "."
15 print "инструцтионс? ы/н"
16 input y$
17 if mid$(y$, 1, 1) = "ы" then gosub 456
18 print ". "
19 f = 0
20 u = 0
21 if r = 1 then 136
22 if a < 18 or can = 1 and (p(21) = a or p(21) = - 1) then 25
23 print "ыоу цант бреатхе!! тхе аир ис поисонед бы фумес."
24 goto 136
25 rem print a
26 g$ = "ыоу аре ин а цорридор йунцтион."
27 if a = 1 then g$ = "ыоу аре ин ыоур спаце ыацхт, вхицх ис доцкед витх тхе гиант спаце вре"
28 if a = 1 then g$ = g$ + "цк. то тхе нортх ис ан аир-лоцк. ит ис опен."
29 if a = 2 then g$ = "ыоу хаже ентеред тхе доцкинг баы оф тхе цруисер. тхе ареа ис димлы л"
30 if a = 2 then g$ = g$ + "ит бы лигхт фром дистант старс. тхе аир-лоцк хас цлосед анд тхе ел"
31 if a = 2 then g$ = g$ + "ецтрониц лоцк хас енгагед. а пассаге леадс еаст."
32 if a = 3 or a = 4 then g$ = "сежерал цорридорс интерсецт хере. "
33 if a = 3 then g$ = g$ + "стревн ароунд тхе флоор аре пиецес оф брокен мацхинеры. тхе цоррид"
34 if a = 3 then g$ = g$ + "ор ис лит бы тхе емергенцы лампс, форежер дравинг тхеир повер фром "
35 if a = 3 then g$ = g$ + "тхе солар стацкс."
36 if a = 4 then g$ = g$ + "соме цаблес хаже беен сежеред анд аре хангинг, дангероуслы, фром "
37 if a = 4 then g$ = g$ + "тхе цеилинг."
38 if a = 5 then g$ = "ыоу аре ин а смалл обсержатион порт. тхе нортх анд вест валлс аре мад"
39 if a = 5 then g$ = g$ + "е оф а гласс-лике материал. ит ис сховинг сигнс оф стресс."
40 if a = 6 then g$ = "ыоу аре ин а сержице туннел. тхере ис а поол оф оил он тхе флоор."
41 if a = 8 then g$ = "тхис ис а маин цорридор йунцтион."
42 if a = 6 then g$ = "ыоу аре ин а сержице туннел. сомеоне хас риппед тхе цаблес анд еяуипмент"
43 if a = 6 then g$ = g$ + " фром тхе валлс анд манглед тхем."
44 if a = 7 then g$ = "ыоу аре ин а сержице туннел. а поол оф оил ис он тхе флоор."
45 if a = 9 then g$ = "ыоу аре ин ан обсержатион порт. тхроугх тхе еастерн валл ыоу цан сее "
46 if a = 9 then g$ = g$ + "тхе дистант емеры небула."
47 if a = 10 then g$ = "нов ыоу аре ин ан аццесс цхамбер. то тхе нортх ис а флимсы ладдер "
48 if a = 10 then g$ = g$ + "леадинг упвардс."
49 if a = 11 then g$ = "ыоу аре он тхе ладдер ин а плеьигласс обсержатион тубе, вхицх ис усе"
50 if a = 11 then g$ = g$ + "д то сержице тхе стабилизер ретрос."
51 if a = 12 then g$ = "ыоу аре стандинг ат тхе топ оф а ладдер. а пассаге леадс соутх."
52 if a = 13 then g$ = "еяуипмент линес тхе валлс. тхис роом ис тхе релаы статион бетвеен тхе "
53 if a = 13 then g$ = g$ + "уппер анд ловер децкс оф тхе цруисер."
54 if a = 14 then g$ = "ыоу аре ин а дарк роом. то тхе вест ис а роом маркед 'трансмат'."
55 if a = 15 then g$ = "ыоу аре ин а лонг, димлы лит пассаге. тхе аир смеллс оф озоне."
56 if a = 16 then g$ = ". ыоу аре стандинг ин а смалл метал баы. ин фронт оф ыоу аре сежерал "
57 if a = 16 then g$ = g$ + "цомпутер банкс оне оф тхем беаринг тхе ворд . трансмат."
58 if a = 17 then g$ = "тхис ис ан есцапе под. то ацтижате ит ыоу неед то кнов а сецрет цоде"
59 if a = 18 then g$ = "бефоре ыоу лоомс оне оф тхе цруисер'с варп енгинес. ит ис ундамагед."
60 if a = 19 then g$ = "ыоу аре ин тхе маинтенанце ворксхоп."
61 if a = 20 or a = 34 then g$ = "тхе варп енгине стретцхес аваы то тхе соутх."
62 if a > 20 and a < 26 then g$ = "ыоу аре ин а лонг, дарк цорридор."
63 if a = 27 then g$ = "ыоу аре ин а смалл роом. тхере ис но ваы оут."
64 if a = 28 then g$ = "ыоу аре он а ледге ожерлоокинг а дееп схафт."
65 if a = 30 then g$ = "ыоу аре он тхе бридге оф тхе цруисер."
66 if a = 31 then g$ = "ыоу аре он тхе бридге. бефоре ыоу ис а ларге цхарт."
67 if a = 32 then g$ = "тхе мануал цонтролс оф тхе цруисер лине тхе валлс."
68 if a = 33 then g$ = g$ + ". бефоре ыоу ис а смалл цомпутер терминал лабеллед "
69 if a = 33 then g$ = g$ + ". флигхт цомпутер. ит сеемс тоо смалл фор суцх а таск. соме оф итс"
70 if a = 33 then g$ = g$ + " цирцуит цардс аре миссинг."
71 if a = 35 then g$ = "бефоре ыоу лоомс а варп енгине. ит хас беен бурнт оут."
72 if a = 37 then g$ = "хере тхе маин цорридор ендс. фром ит бранцх тхрее аццесс туннелс."
73 if a = 38 then g$ = ".. ыоу аре цравлинг тхроугх а лонг, дарк виринг цондуит. тхе сурфацес "
74 if a = 38 then g$ = g$ + " аре цожеред ин схарп рижетс тхат маке цравлинг агонизинг."
75 if a = 39 then g$ = "бефоре ыоу лоомс оне оф тхе варп енгинес. ит стретцхес аваы то тхе "
76 if a = 39 then g$ = g$ + "нортх."
77 if a = 40 then g$ = "ыоу аре ин а лонг еаст-вест аццесс туннел."
78 if a = 42 then g$ = g$ + " ыоу аре валкинг ин цирцлес."
79 if a = 43 then g$ = "ыоу аре ат анотхер цорридор йунцтион."
80 if a = 45 then g$ = "тхе цорридорс аре цхангинг бефоре ыоур жеры еыес!"
81 if a = 46 then g$ = "ыоу аре ин ан ендлесс пассаге. тхе силенце ис террифыинг..."
82 if a = 47 then g$ = "ыоу аре стандинг ин ан ацоустицаллы сеалед роом."
83 if a = 47 then gosub 476
84 if a = 48 then g$ = "бефоре ыоу ис ан елецтрониц мине фиелд... оне фалсе степ вилл бе фатал."
85 if a = 49 then g$ = "ыоу суржижед тхе мине фиелд анд хаже стумблед инто а дименсионал вар"
86 if a = 49 then g$ = g$ + "п. нотхинг аппеарс то бе вхере ит ис. а пассаге леадс соутх."
87 if a = 50 then g$ = "ыоу хаже пенетратед тхе цомпутер цомплеь. "
88 if a = 50 and p(11) = 50 then poke 36878, 15: poke 36876, 210: poke 36877, 254
89 if a = 50 and p(11) = 50 then g$ = g$ + "тхе сониц протецтион сыстем ис цонфусинг ыоур тхоугхтс"
90 if a = 50 and p(11) = 50 then tr = tr + 1
91 if tr > 1 then print "ыоур браинс хаже беен сцрамблед бы пролонгед еьпосуре то сониц"
92 if tr > 1 then print "жибратионс. ыоу алмост маде ит!" : goto 335
93 if a = 51 then g$ = "тхере ис а хеажы ирон доор то тхе нортх."
94 if a = 53 then g$ = ". ыоу аре ин а смалл обсержатион буббле. фром хере ыоу цан сее ыоур ыац"
95 if a = 53 then g$ = g$ + "хт ин тхе доцкинг баы. тхе дамаге то тхе ыацхт аппеарс то бе минор"
96 if a = 52 or a = 54 then g$ = "ыоу аре ин а лонг димлы лит пассаге. "
97 if a = 54 then g$ = g$ + "тхере ис а боды он тхе флоор. ит хас беен схот."
98 x = 1
99 if g$ = "" then g$ = " "
100 h = x + 20
101 if h > len(g$) then h = len(g$)
102 if mid$(g$, h, 1) = " " or h = len(g$) then 105
103 h = h - 1
104 goto 102
105 print mid$(g$, x, h - x + 1)
106 if h = len(g$) then 109
107 x = h + 1
108 goto 100
109 if a = 10 and c(a, 1) = 0 then print "ит ис тоо дамагед то цлимб"
110 if a = 12 and c(a, 1) = 0 then print "тхе ладдер хас брокен фрее анд цоллапсед."
111 rem if a = 48 and c(a, 4) = 128 then print "."
112 if u > 200 then print "ыоур оьыген ис руннинг оут."
113 if u < 230 then 116
114 can = 0
115 print "ин фацт ыоу хаже рун оут!"
116 v = 0
117 for l = 7 to 24
118 if p(l) = a then v = v + 1
119 next l
120 if v = 0 then 125
121 print "ыоу цан алсо сее:"
122 for l = 7 to 24
123 if p(l) = a then gosub 425
124 next l
125 v = 0
126 for l = 1 to 6
127 if p(l) = a then v = v + 1
128 next l
129 if v = 0 then 135
130 print
131 print "неарбы тхере луркс"
132 for l = 1 to 6
133 if p(l) = a then gosub 425
134 next l
135 r = 1
136 if a <> 50 or p(11) <> 50 then poke 36878, 0: poke 36877, 0: poke 36876, 0
137 print: print "ок... вхат нов?"
138 n(1) = 0
139 n(2) = 0
140 input a$
141 if a$ = "н" then n(1) = 1: goto 175
142 if a$ = "с" then n(1) = 2: goto 175
143 if a$ = "в" then n(1) = 3: goto 175
144 if a$ = "е" then n(1) = 4: goto 175
145 if a$ = "уп" then n(1) = 1: goto 175
146 if a$ = "довн" then n(1) = 1: goto 175
147 a$ = a$ + " "
148 rem n(1) = 0
149 rem n(2) = 0
150 print: print: print
151 print
152 u = u + 1
153 t = 1
154 m = 0
155 m = m + 1
156 restore
157 for x = 1 to 55
158 read n$
159 if m + len(n$) > len(a$) then 171
160 if mid$(a$, m, len(n$)) = n$ then 163
161 next x
162 goto 155
163 n(t) = x
164 for z = m to len(a$)
165 if mid$(a$, z, 1) = " " then 167
166 next z
167 t = t + 1
168 m = z
169 if t > 2 then 171
170 goto 155
171 if t <> 1 then 174
172 print "и дон'т ундерстанд тхат!"
173 goto 21
174 n(1) = n(1) - 24
175 rem print n(1);n(2)
176 if n(1) = 14 or n(1) = 13 then n(1) = 12
177 if n(1) < 1 then 172
178 if a = 11 then c(10, 1) = 0
179 if a = 11 then c(12, 1) = 0
180 rem closesecret rooms
181 if a = 2 then j = 1
182 if a = 50 then c(22, 1) = 53
183 if a = 50 then c(45, 1) = 31
184 if p(24) <> 17 then fu = 1
185 if fu = 1 and p(24) = 17 then c(17, 4) = 12
186 if a = 49 then c(48, 4) = 49
187 if n(1) = 27 then n(1) = 10
188 if n(1) = 26 then 486
189 if n(1) = 15 then n(1) = 16
190 if n(1) > 27 then n(1) = n(1) - 27
191 if n(1) < 15 then 195
192 if n(1) > 16 then print "хов?"
193 if n(1) < 17 then print "хов деструцтиже!!"
194 goto 138
195 rem
196 if n(1) < 7 or n(1) > 9 then 211
197 on n(1) - 6 goto 198, 200, 210
198 r = 0
199 goto 21
200 print "ыоу аре царрыинг "
201 v = 0
202 for l = 7 to 24
203 if p(l) = - 1 then v = v + 1
204 next l
205 if v = 0 then print "нотхинг." : goto 209
206 for l = 7 to 24
207 if p(l) = - 1 then gosub 425
208 next l
209 goto 21
210 goto 335
211 for z = 1 to 6
212 if p(z) = a then 215
213 next z
214 goto 228
215 if n(2) = 20 then 228
216 if z = 5 then goto 223
217 restore
218 for mo = 1 to z
219 read k$
220 next mo
221 print "ауууугх... ыоу'же йуст беен киллед бы а " : print k$
222 goto 335
223 print "тхе русты дроне пицкед ыоу уп анд царриед ыоу то анотхер плаце."
224 a = 33
225 r = 0
226 p(5) = p(5) + 7
227 goto 21
228 if n(1) > 4 then 242
229 if p(8) = - 1 or p(8) = a then 232
230 n(1) = int(rnd(1) * 4 + 1)
231 rem
232 b = c(a, n(1))
233 if b = 0 then print "ыоу цант го тхат ваы."
234 if b = 128 then print "тхе плеьигласс црацкс тхен схаттерс. ыоу аре суцкед оут инто спаце."
235 if b = 129 then print "ыоу фалл довн тхе схафт анд аре киллед."
236 if b = 130 then print "ыоу степ инто тхе аир-лоцк. тхе сецонд аир-лоцк доор опенс анд"
237 if b = 130 then print "ыоу аре суцкед оут инто спаце."
238 if b > 127 then 335
239 if b > 0 then a = b
240 r = 0
241 goto 21
242 if n(1) <> 5 then 257
243 if n(1) <> 5 then 257
244 r = 0
245 if a = 16 and p(17) = - 1 then 250
246 a = 16
247 print "судденлы.. тхе роом жанисхес фром бефоре ыоу."
248 for de = 1 to 1000: next de
249 goto 21
250 print "ентер дестинатион цоде"
251 input co$
252 if left$(co$, 1) = "ы" then a = 1: goto 247
253 if left$(co$, 1) = "б" then a = 31: goto 247
254 if left$(co$, 1) = "ц" then a = 41: goto 247
255 goto 21
256 goto 247
257 if n(1) <> 6 then 260
258 rem
259 goto 21
260 if n(2) < 1 then 172
261 if p(n(2)) = - 1 or p(n(2)) = a then 264
262 print "вхере? и цан'т сее ит."
263 goto 21
264 on n(1) - 9 goto 265, 274, 276
265 n = 1
266 for x = 1 to 24
267 if p(x) = - 1 then n = n + 1
268 next x
269 if n < 12 then 272
270 print "ыоу аре царрыинг тоо маны обйецтс."
271 goto 21
272 p(n(2)) = - 1
273 goto 136
274 p(n(2)) = a
275 goto 136
276 if n(2) > 17 and n(2) < 23 then 279
277 print "нотхинг хаппенс!"
278 goto 136
279 on n(2) - 17 goto 311, 280, 289, 277, 326
280 if a = 2 or a = 27 then 283
281 print "ит вон'т опен"
282 goto 21
283 print "ыоу опенед тхе доор."
284 p(n(2)) = a
285 r = 0
286 if a = 2 then a = 1
287 if a = 27 then a = 54
288 goto 21
289 if z < 7 then 292
290 print "тхере'с нотхинг то дестроы!"
291 goto 21
292 f = f + 1
293 rem * * * * modificati on was 15
294 if rnd(1) * 7 + 10 > f then 297
295 print "ыоу схоот ат ит анд мисс. тхе мацхине деалс ыоу а фатал воунд."
296 goto 335
297 if rnd(1) < .38 then 306
298 l = int(rnd(1) * 4)
299 if z = 5 then goto 223
300 if l = 0 then print "ыоу фире ат тхе мацхине бут ит можес асиде."
301 if l = 1 then print "тхе мацхине ис дамагед бут ит аттацкс агаин."
302 if l = 2 then print "тхе схот дамагес тхе мацхине слигхтлы. ит аттацкс агаин."
303 if l = 3 then print "ыоу миссед анд ит фигхтс бацк витх а логицал цалмнесс тхат"
304 if l = 3 then print "алармс ыоу."
305 goto 21
306 print "тхе схот ис велл аимед анд тхе мацхине сцуттлес аваы, бадлы дамагед."
307 p(n(2)) = - 1
308 if z = 3 or z = 5 then p(z) = p(z) + 10
309 if p(z) = a then p(z) = 0
310 goto 21
311 if p(9) = - 1 or p(9) = a then 315
312 print "тхат вон'т бурн, думмы!! ин фацт, тхе матцх вент оут."
313 mat = 0
314 goto 21
315 if mat = 1 then 318
316 print "бут тхе матцх ис оут, ступид!!"
317 goto 21
318 print "тхе фусе бурнт аваы анд... боом!!... тхе еьплосион блев ыоу оут оф тхе ваы!!"
319 r = 0
320 if a = 2 then c(a, 2) = 1
321 if a = 51 then c(a, 1) = 130
322 if a > 1 then a = a - 1
323 if a = 20 then c(20, 3) = 19
324 p(9) = 0
325 goto 21
326 if a = 28 then 329
327 print "ит'с тоо дангероус!!!"
328 goto 21
329 print "ыоу десценд тхе ропе, бут ит дропс 10 феет схорт оф тхе флоор."
330 print "ыоу йумп тхе рест оф тхе ваы."
331 r = 0
332 p(n(2)) = a
333 a = 27
334 goto 21
335 s = 0
336 for x = 7 to 17
337 if p(x) = - 1 then s = s + x - 6
338 if p(x) = 1 then s = s + (x - 6) * 2
339 next x
340 print: print: print: print
341 print "ыоу гот а сцоре оф "
342 print s;
344 print "ин" ;u; " можес."
345 if a > 1 or j < 1 then 372
346 print "ыоу спенд тхе неьт даы репаиринг ыоур ыацхт витх тхе еяуипмент"
347 print "тхат ыоу фоунд он тхе врецк. "
348 print "хопинг тхат ыоу хаже беен суццессфул ин репаиринг тхе ыацхт "
349 print "ыоу маноеужре тхе ыацхт инто спаце анд енгаге тхе хыпердриже... "
350 for de = 1 to 4000: next de
351 if s > 79 then 362
352 if s < 80 then print "тхе ыацхт бегинс то може форвард, тхен судденлы тхе дриже "
353 if s < 80 then print "ожерлоадс анд еьплодес бловинг ыоу инто цосмиц дуст"
354 poke 36878, 15
355 for x = 255 to 128 step - 1
356 poke 36877, x
357 for de = 1 to 20: next de
358 poke 36874, x
359 next x
360 for x = 15 to 0 step - 1 : for y = 1 to 20: next y: poke 36878, x: next x
361 goto 372
362 if s < 110 then print "тхе хыпердриже рефусес то енгаге, леажинг ыоу то дрифт ин спаце."
363 if s < 110 then print "перхапс сомеоне вилл хеар ыоур маыдаы" : goto 372
364 if s < 126 then print "тхе хыпердриже енгагес анд тхе ыацхт можес словлы офф инто спаце."
365 if s < 126 then print "ыоу финд тхат ыоу аре лимитед то халф спеед. ит маы таке а вхиле"
366 if s < 126 then print "бут ыоу вилл гет хоме!! " : goto 372
367 if s = 126 then print "тхе алиен хыпердриже ис супериор то тхе олд хыпердриже."
368 for x = 1 to 2000: next x
369 if s = 126 then print ". ыоу аре абле то ацхиеже спеедс греатер тхан ежер бефоре!!"
370 if s = 126 then print "иф ыоу селл тхе дриже ыоу вилл бе оне оф тхе рицхест мен он еартх."
371 if s = 126 then print "цонгратулатионс!! ыоу маде ит."
372 rem
373 print "анотхер аджентуре?"
374 input a$
375 if left$ (a$, 1) = "ы" then 3
376 print "ыес ор но - тхис ис ыоур ласт цханце!!"
377 input w$
378 if left$ (w$, 1) = "ы" then 3
379 print " ыоу хаже беен плаыинг хыпердриже фор"
380 print left$(ti$, 2); " хоурс " ;mid$(ti$, 3, 2); " минутес!!"
381 for de = 1 to 5000: next de
382 poke 36879, 8
383 end
384 rem
385 restore
386 for x = 1 to 56
387 read b$
388 next x
389 dim p(24)
390 for x = 1 to 24
391 read p(x)
392 next x
393 dim c(54, 4)
394 for x = 1 to 54
395 for y = 1 to 4
396 read c(x, y)
397 next y
398 next x
399 return
400 data "дроне", "'дроид", "хуманоид", "мацхине", "дроне", "робот", "пумп"
401 data "цомпасс", "бомб", "меморы", "процессор", "тапе"
402 data "боок", "сержо", "тоол кит", "цлоцк", "брацелет", "матцхес", "сцревдрижер"
403 data "бластер", "маск", "ропе", "магнет", "фусе", "нортх"
404 data "соутх"
405 data "вест", "еаст", "трансмат", "апе", "лоок", "лист", "яуит", "таке"
406 data "дроп", "усе", "усинг", "витх", "цут", "бреак", "уп"
407 data "унлоцк", "опен", "килл", "схоот", "лигхт", "бурн", "довн", "йумп", "реад", "гет", "з" , "з" , "з" , "з" , "хелп"
408 data 5, 36, 42, 16, 52, 25, 37, 1, 26, 50, 50, 33, 21, 41, 19, 9, 27, 2, 19, 7, 12, 40, 34, 17
409 data 2, 0, 0, 0, 128, 0, 128, 3, 5, 6, 2, 4, 3, 0, 3, 8
410 data 128, 4, 128, 9, 0, 0, 3, 7, 8, 0, 6, 0, 9, 7, 10, 9, 10, 8, 5, 128, 11
411 data 0, 5, 9, 12, 10, 128, 128, 11, 36, 17, 17, 15, 14, 0, 0, 13, 0, 16, 51, 13, 31, 26, 26, 26, 0, 29, 14, 0
412 data 0, 0, 0, 0, 20, 19, 0, 0, 0, 0, 18, 18, 39, 0, 21, 22, 0, 20, 0, 53, 21, 0, 23, 0, 0, 22, 36, 0, 0, 36
413 data 25, 28, 0, 24, 35, 0, 26, 15, 15, 0, 0, 0, 0, 129, 0, 0, 0, 0, 52, 0, 16, 0, 0, 128, 31, 0, 15, 30, 32
414 data 0, 33, 0, 31, 32, 0, 0, 128, 35, 39, 0, 0, 0, 34, 25, 0, 37, 12, 23, 24, 36, 38, 38, 38
415 data 37, 39, 39, 39, 37, 0, 40, 40
416 data 0, 0, 39, 39, 46, 42, 41, 41, 41, 41, 43, 43, 41, 44, 42, 42, 45, 42, 46, 46, 46, 44, 46, 47
417 data 41, 41, 42, 42, 0, 48, 45, 0, 47, 49, 45, 0, 50, 0, 0, 48, 49, 0, 0, 0, 0, 54, 14, 0, 29, 53, 0, 0
418 data 0, 22, 0, 0, 51, 27, 0, 0
419 rem poke 36879, 78
420 rem poke 36869, 194
421 print "."
422 print "хыпердриже"
423 print "бы кен стоне анд йохн харды"
424 return
425 restore
426 for k = 1 to l
427 read h$
428 next k
429 print "а" ;
430 if l = 5 then print " русты " ;
431 if l = 7 then print " фуел " ;
432 if l = 24 then print " смалл " ;
433 if l = 4 then print " сецуриты " ;
434 if l = 1 then print " сержице " ;
435 if l = 3 then print " баттеред " ;
436 if l = 13 then print "н интерестинг " ;
437 if l = 14 then print " стабилизер " ;
438 if l = 18 then print " боь оф " ;
439 if l = 11 then print " цомпутер " ;
440 if l = 17 then print " трансмат " ;
441 if l = 19 then print " сониц " ;
442 if l = 22 then print " тхин анд татты " ;
443 if l = 16 then print " дигитал " ;
444 if l = 20 then print " ханд-хелд " ;
445 if l = 2 then print " дилапидатед " ;
446 if l = 6 then print "н олд " ;
447 if l = 8 then print " " ;
448 if l = 9 then print " " ;
449 if l = 10 then print " цомпутер " ;
450 if l = 12 then print " цомпутер " ;
451 if l = 15 then print " " ;
452 if l = 21 then print " гас " ;
453 if l = 23 then print " смалл " ;
454 print h$
455 return
456 print "."
457 print "ыоур спаце ыацхт хас беен дамагед ин а фреак спаце аццидент."
458 print "ыоу аре форцед то доцк витх а десертед врецк ин ан аттемпт то финд"
459 print "тхе еяуипмент неедед то репаир ыоур ыацхт."
460 print "цонтинуе?" : input w$: print "."
461 print "то гет ыоу стартед хере аре соме цоммандс ыоу маы усе :-"
462 print "нортх лоок лист яуит"
463 print "цонтинуе?" : input w$
464 return
465 print "....................."
466 print ". емергенцы ."
467 print ". цомпутер схутдовн ."
468 print ". процедуре ."
469 print ". ."
470 print ". трансмат инто ."
471 print ". цомпутер жаулт анд."
472 print ". реможе процессор ."
473 print ". анд меморы цардс. ."
474 print "....................."
475 return
476 if echo = 1 then return
477 print "ыоу аре стандинг ин ан ацоустицаллы сеалед роом." : print: print
478 print "ок, вхат нов?"
479 input echo$
480 print: print
481 print echo$
482 print: print
483 if echo$ <> "ецхо" then 479
484 echo = 1
485 return
486 if a = 31 then gosub 465: goto 136
487 if p(13) = - 1 or p(13) = a then print "а лонг тиме аго ин а галаьы фар, фар аваы.." : goto 21
488 print "вхат до ыоу вант то реад, тхе бранд наме он ыоур боотс, перхапс?"
489 goto 136
